joescharf/esphome-secplus-gdo-esp32c6/esp-idf-build/sdkconfig.defaults
# ESP32-C6 (RISC-V) target configuration
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32C6=y
